// const IMAGE_URL = "http://reactmarathon-api.herokuapp.com/assets/";
// //нужно стабу
// const DEFAULT_IMAGE_URL = IMAGE_URL + "subzero.gif";

const LOGS = {
    start: ['Часы показывали [time], когда [first] и [second] бросили вызов друг другу.'],
    end: [
        'Результат удара [first]: [second] - труп',
        '[second] погиб от удара бойца [first]',
        'Результат боя: [second] - жертва, [first] - убийца',
    ],
    hit: [
        '[first] пытался сконцентрироваться, но [second] разбежавшись раздробил копчиком левое ухо врага.',
        '[first] расстроился, как вдруг, неожиданно [second] случайно раздробил грудью грудину противника.',
        '[first] зажмурился, а в это время [second], прослезившись, раздробил кулаком пах оппонента.',
        '[first] чесал <вырезано цензурой>, и внезапно неустрашимый [second] отчаянно размозжил грудью левый бицепс оппонента.',
        '[first] задумался, но внезапно [second] случайно влепил грубый удар копчиком в пояс оппонента.',
        '[first] ковырялся в зубах, но [second] проснувшись влепил тяжелый удар пальцем в кадык врага.',
        '[first] вспомнил что-то важное, но внезапно [second] зевнув, размозжил открытой ладонью челюсть противника.',
        '[first] осмотрелся, и в это время [second] мимоходом раздробил стопой аппендикс соперника.',
        '[first] кашлянул, но внезапно [second] показав палец, размозжил пальцем грудь соперника.',
        '[first] пытался что-то сказать, а жестокий [second] проснувшись размозжил копчиком левую ногу противника.',
        '[first] забылся, как внезапно безумный [second] со скуки, влепил удар коленом в левый бок соперника.',
        '[first] поперхнулся, а за это [second] мимоходом раздробил коленом висок врага.',
        '[first] расстроился, а в это время наглый [second] пошатнувшись размозжил копчиком губы оппонента.',
        '[first] осмотрелся, но внезапно [second] робко размозжил коленом левый глаз противника.',
        '[first] осмотрелся, а [second] вломил дробящий удар плечом, пробив блок, куда обычно не бьют оппонента.',
        '[first] ковырялся в зубах, как вдруг, неожиданно [second] отчаянно размозжил плечом мышцы пресса оппонента.',
        '[first] пришел в себя, и в это время [second] провел разбивающий удар кистью руки, пробив блок, в голень противника.',
        '[first] пошатнулся, а в это время [second] хихикая влепил грубый удар открытой ладонью по бедрам врага.',
    ],
    defence: [
        '[first] потерял момент и храбрый [second] отпрыгнул от удара открытой ладонью в ключицу.',
        '[first] не контролировал ситуацию, и потому [second] поставил блок на удар пяткой в правую грудь.',
        '[first] потерял момент и [second] поставил блок на удар коленом по селезенке.',
        '[first] поскользнулся и задумчивый [second] поставил блок на тычок головой в бровь.',
        '[first] старался провести удар, но непобедимый [second] ушел в сторону от удара копчиком прямо в пятку.',
        '[first] обманулся и жестокий [second] блокировал удар стопой в солнечное сплетение.',
        '[first] не думал о бое, потому расстроенный [second] отпрыгнул от удара кулаком куда обычно не бьют.',
        '[first] обманулся и жестокий [second] блокировал удар стопой в солнечное сплетение.'
    ],
    draw: ['Ничья - это тоже победа!']
};
